{
    The Two Towers
    theTwoTowers {
        Question 1“ 1”: {“
            Img”: “”;“Question”: “Who banished Eomer from the kingdom of Rohan ? ”,
            “Answers”: {“
                1”: “Grima”,
                “2”: “King Theoden”,
                “3”: “Eowyn”,
                “4”: ”He wasn 't banished”

                //King Theoden"You are banished from the kingdom of Rohan, under pain of death." Grima said this to Eomer when Eomer was telling Grima that Grima has haunted Eowyn. But he had no power to banish him. Grima got Theoden to sign the document. And then Grima said to Eomer, "It does not come from me, it comes from the king."
            }“
            answerIndex: 1
        }
        Question 2“ 2”: {“
            Question”: “While Aragorn,
            Legolas,
            and Gimli were trying to
            catch up to Merry and Pippin,
            Gimli mentions something about two kinds of races.What did he say the Dwarves were dangerous at ? ”,
            “Answers” : {“
                1”: “Cross Country”,
                “2”: “He didn’ t mention racing”,
                “3”: “Relays”,
                “4”: ”Short Distances”

                //CorrectShort DistancesGimli says that he's wasted on cross country, but is dangerous over short distances.
            }“
            answerIndex: 3
        }
        Question 3“ 3”: {“
            Question”: “Finish this quote by Legolas to Gimli: "Shall I _______ it to you, or would you like me to find you a ______."”,
            “Answers”: {“
                1”: “Describe And Box”,
                “2”: “Explain and Box”,
                “3”: “Explain and Crate”,
                “4”: ”Describe and Crate”
            }“
            answerIndex: 0
        }
        Question 4“ 4”: {“
            Question”: “When the Orcs and Uruk - Hai soldiers who took Merry and Pippin were looking
            for meat,
            in the words of an Uruk - Hai soldier,
            why was "meat back on the menu" ? ”,
            “Answers” : {“
                1”: “The leader had just killed an orc who was trying to eat Merry and Pippin”,
                “2”: “The Uruk - Hai,
                and Orcs were just going to eat the two hobbits ' legs”,“
                3”: “The Uruk - Hai,
                and Orcs were going to eat Merry and Pippin”,
                “4”: ”The leader was going to sacrifice himself so the others would be fed”

                //As they were feasting on the dead Orc, the Rohirrim soldiers ambushed the group, leaving none alive. Merry and Pippin managed to crawl away, cut the binds on their hands, and escape into Fangorn Forest. One Orc, however, also got away and followed Merry and Pippin into the forest. The Orc caught Merry and was holding a blade up to him. Then, an ent (Treebeard) stomped on the Orc. Merry and Pippin were saved.
            }“
            answerIndex: 0
        }
        Question 5“ 5”: {“
            Question”: “You would only know the answer to this question
            if you watched the extended version of "The Two Towers".After the battle of Helms Deep,
            Gimli and Legolas had a chat about who killed the most enemies.How many did Gimli have ? ”,
            “Answers” : {“
                1”: “38”,
                “2”: “33”,
                “3”: “43”,
                “4”: ”48”

                //Legolas: "Final count, forty two." Gimli: "42? That's not bad for a pointy - eared Elvish princeling. I myself am sitting pretty on forty three." And then Legolas whips out an arrow and shoots the orc that Gimli was sitting on. Legolas: "Forty three!" Gimli: "He was already dead." Legolas: "He was twitching." Gimli: "He was twitching, because he's got my axe embedded in his nervous system!"

            }“
            answerIndex: 2
        }
        Question 6“ 6”: {“
            Question”: “This is another question you wouldn 't have known without the extended version. After the battle of Helms Deep, Gimli and Legolas had a chat about who killed the most enemies. How many did Legolas have? ”,“
            Answers”: {“
                1”: “47”,
                “2”: “32”,
                “3”: 37”,
                “4”: “42”

                //Gimli beat Legolas, 43 - 42.
            }“
            answerIndex: 3
        }
        Question 7“ 7”: {“
            Question”: “Who had come to the aid of men at the battle of Helm 's Deep?”,“
            Answers”: {“
                1”: “The Dwarves”,
                “2”: “More Men”,
                “3”: “The Elves”,
                “4”: ”Two Of The Answers Are Correct”

                //Haldir and his crew of elves came in the beginning, and then Gandalf brought Eomer and the Rohirrim towards the end of the battle.

            }“
            answerIndex: 3
        }
        Question 8“ 8”: {“
            Question”: “Who returned the necklace from Arwen to Aragorn ? ”,
            “Answers”: {“
                1”: “Legolas”,
                “2”: “Eowyn”,
                “3”: “Gimli”,
                “4”: ”Gandalf”

                //Legolas returned it. Before returning it, he said, 'Le abdollen', meaning 'You are late'.
            }“
            answerIndex: 0
        }
        Question 9“ 9”: {“
            Question”: “According to Legolas,
            where was the specific place the uruks are taking the hobbits ? ”,
            “Answers” : {“
                1”: “Mordor”,
                “2”: “Fangorn Forest”,
                “3”: “Rohan”,
                “4”: ”Isengard”

                //Legolas says, 'They're taking the hobbits to Isengard!'. This was before Merry and Pippin escaped.
            }“
            answerIndex: 3
        }
        Question 10“ 10”: {“
            Question”: “Who says,
            'Unleash the river' ? ”,
            “Answers” : {“
                1”: “Saruman”,
                “2”: “Treebeard”,
                “3”: “Sauron”,
                “4”: “Gandalf”

                //CorrectTreebeardOne of the ents, Treebeard says this. The ents want to 'release the river' to wash away all of Saruman's orcs, uruk-hai and their work equipment.
            }“
            answerIndex: 1
        }

    }

    Return of the King

    returnOfTheKing {
        Question 1“ 1”: {“
            Question”: “Who is the King described in the title "Return of the King" ? ”,
            “Answers”: {“
                1”: “Saruman”,
                “2”: “Sauron”,
                “3”: “Éomer”,
                “4”: ”Aragon”

                //Yes, it is Aragorn. Considering he's the heir to the throne of Gondor, it makes sense that he's the King.
            }“
            answerIndex: 3
        }
        Question 2“ 2”: {“
            Question”: “Who destroys the One Ring ? ”,
            “Answers”: {“
                1”: “Gollum”,
                “2”: “Sam”,
                “3”: “Frodo”,
                “4”: ”Sauron”

                //Gollum does, albeit by accident. Frodo puts on the ring, and so Gollum, trying to get "My Precious" back, bites off Frodo's index finger. Just an author's note: Gollum & Sméagol are the same person. Sméagol changed into Gollum with his continued use of the One Ring.
            }“
            answerIndex: 0
        }
        Question 3“ 3”: {“
            Question”: “Who says the line "I am no man!" ? ”,
            “Answers”: {“
                1”: “Eowyn”,
                “2”: “Pippin”,
                “3”: “Mary”,
                “4”: ”Arwen”

                //CorrectEowynShe says this line just before she sticks her sword in the Witch King's face, destroying him. She does that so she can save her uncle, Théoden King.
            }“
            answerIndex: 0
        }
        Question 4“ 4”: {“
            Question”: “Who is the last one to enter the Dark Door ? ”,
            “Answers”: {“
                1”: “Gimli”,
                “2”: “Aragon”,
                “3”: “Legolas”,
                “4”: ”None of them go in ”

                    //After the horses are spooked and run off, Aragorn says, "I do not fear death", and enters the Paths of the Dead, followed quickly by Legolas. Gimli hesitates, noting that he'd never hear the end of it if he didn't go with them, since Legolas went in.
            }“
            answerIndex: 0
        }
        Question 5“ 5”: {“
            Question”: “Complete this quote by the King of the Dead,
            "Who enters my ______?"”,
            “Answers”: {“
                1”: “realm”,
                “2”: “premises”,
                “3”: “kingdom”,
                “4”: ”domain”
            }“
            answerIndex: 3
        }
        Question 6“ 6”: {“
            Question”: “Who leads Frodo and Sam(although Sam was told to "go home"
                by Frodo) into the tunnel where a trap awaits ? ”,
            “Answers”: {“
                1”: “The orcs”,
                “2”: “Gollum”,
                “3”: “Saruman”,
                “4”: ”Sauron”

                //Gollum, knowing that Shelob is always hungry, leads the two into a trap. Frodo, not believing Sam when Sam caught Gollum talking to himself (about the trap and the spider), sends Sam away. Sam saves the day, though, and follows Gollum and Frodo into the tunnel, and fights off Shelob from Frodo's paralyzed body.
            }“
            answerIndex: 1
        }
        Question 7“ 7”: {“
            Question”: “Who does Sam marry at the end of the movie ? ”,
            “Answers”: {“
                1”: “Rosie Cotton”,
                “2”: “Éowyn”,
                “3”: “No one”,
                “4”: ”Arwen Evenstar”

                //Yes, he marries his beloved Rosie Cotton and they had 13 children together. The eldest child that is shown at the end of the movie is Sean Astin's (Samwise Gamgee) real-life child. Rosie Cotton and Samwise Gamgee are married. It's implied that later so are Arwen Evenstar and Aragorn. It is also semi-implied that Faramir and Éowyn get together, but that one happens in the book, not the movie.
            }“
            answerIndex”: 0
        }
        Question 8“ 8”: {“
            Question”: “Who,
            among many,
            would die
            if the One Ring wasn 't destroyed?”,“
            Answers”: {“
                1”: “Aragorn”,
                “2”: “Lady Galadriel”,
                “3”: “Arwen Evenstar”,
                “4”: ”Éowyn”

                //CorrectArwen EvenstarArwen's father told Aragorn that she would die if the One Ring wasn't destroyed. Aragorn was also told Arwen's life was tied into the Ring.
            }“
            answerIndex”: 2
        }
        Question 9“ 9”: {“
            Question”: “In King Théoden 's tent, on the eve of the battle at Minas Tirith, who tells Aragorn to: "Put aside the Ranger. Become who you were born to be." ”,“
            Answers”: {“
                1”: “Arwen”,
                “2”: “Theoden”,
                “3”: “Gandalf”,
                “4”: ”Elrond”
            }“
            answerIndex”: 3
        }
        Question 10“ 10”: {“
            Question”: “Who tells Éowyn the following,
            as he is leaving to seek out the army of the dead who live in the mountains ? "It is but a shadow and a thought that you love. I cannot give you what you seek."”,
            “Answers” : {“
                1”: “Faramir”,
                “2”: “Aragorn”,
                “3”: “Eomer”“ 4”: “Theoden”

                //Éowyn is infatuated with Aragorn, but his heart still belongs to Arwen.
            }“
            answerIndex”: 1
        }

    }
]
}